glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
//********************************************************************************
//arm_usart.c
//********************************************************************************
#include "stm32f4xx.h"
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "common.h"
#include "RTE_Device.h"
#include "RTE_Components.h"
#include "Driver_USART.h"
#include "arm_gpio.h"
#include "arm_usart.h"
#include "arm_clock.h"
#include "gpio.h"
#include "usart.h"
#include "ringbuffer.h"
#include "arm_dma.h"

//********************************************************************************
//Macros
//********************************************************************************

// Project:      USART Driver for STM32F405.
// Configured:   via RTE_Device.h configuration file

/* History:
 *  Version 1.0
 *    - Initial release
 *    - Completed Driver_USART1
 *
 *  Version 2.0
 *    - Added DMA support
 */
#define ARM_USART_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(2,0)

// USART Driver flags
#define ARM_USART_FLAG_INITIALIZED       (uint16_t)(1U << 0)
#define ARM_USART_FLAG_POWERED           (uint16_t)(1U << 1)
#define ARM_USART_FLAG_CONFIGURED        (uint16_t)(1U << 2)
#define ARM_USART_FLAG_TX_ENABLED        (uint16_t)(1U << 3)
#define ARM_USART_FLAG_RX_ENABLED        (uint16_t)(1U << 4)

// USART Baudrate Register Divider Masks
#define ARM_USART_DIVIDER_MANTISSA_FOR_OVER16_MASK USART_BRR_DIV_Mantissa_Msk
#define ARM_USART_DIVIDER_FRACTION_FOR_OVER16_MASK USART_BRR_DIV_Fraction_Msk
#define ARM_USART_DIVIDER_MANTISSA_FOR_OVER8_MASK  (uint32_t)(ARM_USART_DIVIDER_MANTISSA_FOR_OVER16_MASK >> 1)
#define ARM_USART_DIVIDER_FRACTION_FOR_OVER8_MASK  (uint32_t)(ARM_USART_DIVIDER_FRACTION_FOR_OVER16_MASK >> 1)

#define _ARM_USART_DEBUG_

#ifdef _ARM_USART_DEBUG_
#include "assert.h"
#endif //_ARM_USART_DEBUG_

#if((RTE_USART1_RX_DMA) || (RTE_USART2_RX_DMA) || (RTE_USART3_RX_DMA) || \
(RTE_UART4_RX_DMA) || (RTE_UART5_RX_DMA) || (RTE_USART6_RX_DMA))
#define USART_USE_RX_DMA 1
#endif //((RTE_USART1_RX_DMA) || (RTE_USART2_RX_DMA) || (RTE_USART3_RX_DMA) || \
(RTE_UART4_RX_DMA) || (RTE_UART5_RX_DMA) || (RTE_USART6_RX_DMA))

#if((RTE_USART1_TX_DMA) || (RTE_USART2_TX_DMA) || (RTE_USART3_TX_DMA) || \
(RTE_UART4_TX_DMA) || (RTE_UART5_TX_DMA) || (RTE_USART6_TX_DMA))
#define USART_USE_TX_DMA 1
#endif //((RTE_USART1_TX_DMA) || (RTE_USART2_TX_DMA) || (RTE_USART3_TX_DMA) || \
(RTE_UART4_TX_DMA) || (RTE_UART5_TX_DMA) || (RTE_USART6_TX_DMA))

#define DMA_BUFF_SIZE 256

//********************************************************************************
//Enums
//********************************************************************************

//********************************************************************************
//Typedefs
//********************************************************************************

// ARM USART Transfer Information (Run-Time)
typedef struct {
    volatile uint32_t      rx_num;        // Total number of data to be received
    volatile uint32_t      tx_num;        // Total number of data to be send
    uint8_t                *p_rx_buf;     // Pointer to in data buffer
    uint8_t                *p_tx_buf;     // Pointer to out data buffer
    volatile uint32_t      rx_cnt;        // Number of data received
    volatile uint32_t      tx_cnt;        // Number of data sent
    uint8_t                tx_def_val;    // Transmit default value (used in USART_SYNC_MASTER_MODE_RX)
    uint8_t                rx_dump_val;   // Receive dump value (used in USART_SYNC_MASTER_MODE_TX)
} ARM_USART_TransferInfo_t;

// ARM USART Information (Run-Time)
typedef struct {
    ARM_USART_SignalEvent_t  cb;            // Event callback
    uint16_t                 flags;         // USART driver flags
    uint8_t                  mode;          // USART mode
    uint32_t                 baudrate;      // Baudrate
    ARM_USART_STATUS         xfer_status;   // USART transfer status
    ARM_USART_MODEM_STATUS   modem_status;  // USART modem status
    ARM_USART_TransferInfo_t xfer_info;     // Transfer information
} ARM_USART_Info_t;

typedef struct {
    bool                    dma_enable;
    ePeriphTypes            dma_name;
    eARM_DMA_StreamNumbers  stream;
    eARM_DMA_ChanNumbers    channel;
    uint8_t                 priority;
    ARM_DMA_SignalEvent_t   cb_event;
} ARM_USART_DMA_t;

// ARM USART Resources definitions
typedef struct {
    ARM_USART_CAPABILITIES capabilities;    // Capabilities
    ePeriphTypes           usart_name;
    USART_TypeDef         *p_reg;           // Pointer to USART peripheral registers
    USART_PinCfg_t        *p_pin;           // Pointer to USART pins configuration
    IRQn_Type              irq_num;         // USART IRQ Number
    ARM_USART_DMA_t       *p_dma_tx;
    ARM_USART_DMA_t       *p_dma_rx;
    ARM_USART_Info_t      *p_info;          // Run-Time Information
} ARM_USART_Resources_t;

//********************************************************************************
//Variables
//********************************************************************************

// Driver Version
static const ARM_DRIVER_VERSION ARM_USART_Driver_Version =
{ ARM_USART_API_VERSION, ARM_USART_DRV_VERSION };

#if (RTE_USART1)
static ARM_USART_Resources_t ARM_USART1_Resources;

#if(RTE_USART1_TX_DMA)
static ARM_USART_DMA_t ARM_USART1_DMA_Tx;
static uint8_t USART1_DMA_TxBuff[DMA_BUFF_SIZE] = {0};
#endif //(RTE_USART1_TX_DMA)

#if(RTE_USART1_RX_DMA)
static ARM_USART_DMA_t ARM_USART1_DMA_Rx;
static uint8_t USART1_DMA_RxBuff[DMA_BUFF_SIZE] = {0};
#endif //(RTE_USART1_RX_DMA)

static ARM_USART_Info_t USART1_Info = {0};
static RingBuffer_t USART1_TxRBuff, USART1_RxRBuff;
static uint8_t USART1_TxRingBuffer[RING_BUFF_SIZE] = {0};
static uint8_t USART1_RxRingBuffer[RING_BUFF_SIZE] = {0};
#endif //(RTE_USART1)

#if (RTE_UART4)
static ARM_USART_Resources_t ARM_UART4_Resources;

#if(RTE_UART4_TX_DMA)
static ARM_USART_DMA_t ARM_UART4_DMA_Tx;
#endif //(RTE_UART4_TX_DMA)

#if(RTE_UART4_RX_DMA)
static ARM_USART_DMA_t ARM_UART4_DMA_Rx;
#endif //(RTE_UART4_RX_DMA)

