glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
static ARM_USART_Info_t UART4_Info = {0};
#endif //(RTE_UART4)

//********************************************************************************
//Prototypes
//********************************************************************************

static ARM_DRIVER_VERSION ARM_USARTx_GetVersion(void);
static ARM_USART_CAPABILITIES ARM_USART_GetCapabilities(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Initialize(ARM_USART_SignalEvent_t  cb,
                                    ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Uninitialize(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_PowerControl(ARM_POWER_STATE  state,
                                      ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Send(const void *data, uint32_t num, ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Receive(void *data, uint32_t num, ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Transfer(const void *data_out, void *data_in, uint32_t num, ARM_USART_Resources_t *usart);
static uint32_t ARM_USART_GetTxCount(ARM_USART_Resources_t *usart);
static uint32_t ARM_USART_GetRxCount(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_Control(uint32_t control, uint32_t arg,
                                 ARM_USART_Resources_t *usart);
static int32_t ARM_USART_SetBaudrate(uint32_t arg, ARM_USART_Resources_t *usart);
static ARM_USART_STATUS ARM_USART_GetStatus(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, ARM_USART_Resources_t *usart);
static ARM_USART_MODEM_STATUS ARM_USART_GetModemStatus(ARM_USART_Resources_t *usart);
static int32_t ARM_USART_PutChar(uint8_t ch, ARM_USART_Resources_t *usart);
static uint8_t ARM_USART_GetChar(ARM_USART_Resources_t *usart);
static void USART_IRQHandler(ARM_USART_Resources_t *usart);
static void USART_cb(uint32_t event, ARM_USART_Resources_t *usart);

#if (USART_USE_RX_DMA)
static void ARM_USART_DMA_RxEvent(uint32_t event, ARM_USART_Resources_t *usart);
#endif //(USART_USE_RX_DMA)

#if (USART_USE_TX_DMA)
static void ARM_USART_DMA_TxEvent(uint32_t event, ARM_USART_Resources_t *usart);
#endif //(USART_USE_TX_DMA)

#if (RTE_USART1)
static void ARM_USART1_Resources_Struct_Init(void);
static ARM_USART_CAPABILITIES ARM_USART1_GetCapabilities(void);
static int32_t ARM_USART1_Initialize(ARM_USART_SignalEvent_t cb);
static int32_t ARM_USART1_Uninitialize(void);
static int32_t ARM_USART1_PowerControl(ARM_POWER_STATE state);
static int32_t ARM_USART1_Send(const void *data, uint32_t num);
static int32_t ARM_USART1_Receive(void *data, uint32_t num);
static int32_t ARM_USART1_Transfer(const void *data_out, void *data_in, uint32_t num);
static uint32_t ARM_USART1_GetTxCount(void);
static uint32_t ARM_USART1_GetRxCount(void);
static int32_t ARM_USART1_Control(uint32_t control, uint32_t arg);;
static ARM_USART_STATUS ARM_USART1_GetStatus(void);
static int32_t ARM_USART1_SetModemControl(ARM_USART_MODEM_CONTROL control);
static ARM_USART_MODEM_STATUS ARM_USART1_GetModemStatus(void);
static void USART1_cb(uint32_t event);

#if(RTE_USART1_RX_DMA)
static void ARM_USART1_DMA_RxEvent(uint32_t event);
#endif //(RTE_USART1_RX_DMA)

#if(RTE_USART1_TX_DMA)
static void ARM_USART1_DMA_TxEvent(uint32_t event);
#endif //(RTE_USART1_TX_DMA)

#endif //(RTE_USART1)

#if (RTE_UART4)

static void ARM_UART4_Resources_Struct_Init(void);

#endif //(RTE_UART4)

//================================================================================
//Private
//================================================================================

static ARM_DRIVER_VERSION ARM_USARTx_GetVersion(void)
{
    return ARM_USART_Driver_Version;
}

static ARM_USART_CAPABILITIES ARM_USART_GetCapabilities(ARM_USART_Resources_t *usart)
{
    return usart->capabilities;
}

static int32_t ARM_USART_Initialize(ARM_USART_SignalEvent_t  cb,
                                    ARM_USART_Resources_t *usart)
{
    if(usart->p_info->flags & ARM_USART_FLAG_INITIALIZED) {
// Driver is already initialized
        return ARM_DRIVER_OK;
    }
// Initialize USART Run-time Resources
    usart->p_info->cb = cb;

// Clear driver variables
    usart->p_info->flags                        = 0U;
    usart->p_info->mode                         = 0U;
    usart->p_info->baudrate                     = 0U;
    usart->p_info->xfer_status.tx_busy          = 0U;
    usart->p_info->xfer_status.rx_busy          = 0U;
    usart->p_info->xfer_status.tx_underflow     = 0U;
    usart->p_info->xfer_status.rx_overflow      = 0U;
    usart->p_info->xfer_status.rx_break         = 0U;
    usart->p_info->xfer_status.rx_framing_error = 0U;
    usart->p_info->xfer_status.rx_parity_error  = 0U;
    usart->p_info->xfer_info.tx_def_val         = 0U;
    usart->p_info->xfer_info.rx_dump_val        = 0U;

// Configure CTS pin
    if(usart->capabilities.cts) {
        ARM_RCC_Periph_ClockCmd(usart-> p_pin[CTS_PIN].port, ENABLE_CMD);
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin,
                     ARM_GPIO_IO_MODE_ALT_FUNC, ARM_GPIO_IO_TYPE_OPEN_DRAIN , ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[CTS_PIN].alt_func);
    }
// Configure RTS pin
    if(usart->capabilities.rts) {
        ARM_RCC_Periph_ClockCmd(usart-> p_pin[RTS_PIN].port, ENABLE_CMD);
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin,
                     ARM_GPIO_IO_MODE_ALT_FUNC, ARM_GPIO_IO_TYPE_PUSH_PULL, ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                     usart-> p_pin[RTS_PIN].alt_func);
    }

// TX, RX, CK pins are configurated in function ARM_USART_Control.

// DMA Initialize
#if(USART_USE_RX_DMA)
    if(ARM_DMA_Initialize(usart->p_dma_rx->dma_name) == FAILED) {
        return ARM_DRIVER_ERROR;
    }
    usart->p_dma_tx->dma_enable = TRUE;
#endif //(USART_USE_RX_DMA)

#if(USART_USE_TX_DMA)
    if(ARM_DMA_Initialize(usart->p_dma_tx->dma_name) == FAILED) {
        return ARM_DRIVER_ERROR;
    }
    usart->p_dma_rx->dma_enable = TRUE;
#endif //(USART_USE_TX_DMA)

    usart->p_info->flags |= ARM_USART_FLAG_INITIALIZED;
    return ARM_DRIVER_OK;
}

