glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
static int32_t ARM_USART_Uninitialize(ARM_USART_Resources_t *usart)
{
// Reset TX pin configuration
    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Reset RX pin configuration
    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin, 0U, 0U, 0U, 0U, 0U);
// Unconfigure CTS pin
    if(usart->capabilities.cts) {
        GPIO_SetData(usart-> p_pin[CTS_PIN].GPIOx, usart-> p_pin[CTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }
// Unconfigure RTS pin
    if(usart->capabilities.rts) {
        GPIO_SetData(usart-> p_pin[RTS_PIN].GPIOx, usart-> p_pin[RTS_PIN].pin, 0U, 0U, 0U, 0U, 0U);
    }

// DMA Uninitialize function
#if(USART_USE_RX_DMA)
    if(ARM_DMA_Uninitialize(usart->p_dma_rx->dma_name) == FAILED) {
        return ARM_DRIVER_ERROR;
    }
#endif //(USART_USE_RX_DMA)

#if(USART_USE_TX_DMA)
    if(ARM_DMA_Uninitialize(usart->p_dma_tx->dma_name) == FAILED) {
        return ARM_DRIVER_ERROR;
    }
#endif //(USART_USE_TX_DMA)

// Reset USART status flags
    usart->p_info->flags = 0UL;
    return ARM_DRIVER_OK;
}

/***********************************************************************************
To stop working with a peripheral the functions PowerControl and Uninitialize need
to be called in this order:
drv->PowerControl (ARM_POWER_OFF);     // Terminate any pending transfers, reset IRQ/DMA, power off peripheral
drv->Uninitialize (...);               // Release I/O pins
************************************************************************************/

static int32_t ARM_USART_PowerControl(ARM_POWER_STATE  state,
                                      ARM_USART_Resources_t *usart)
{
    switch(state) {
        case ARM_POWER_OFF: {
// Disable USART IRQ
            NVIC_DisableIRQ(usart->irq_num);
            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
// Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
            // Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);

// If DMA mode - disable DMA TX stream
            if(usart->p_dma_tx->dma_enable) {
                if(usart->p_info->xfer_status.tx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_tx->dma_name, usart->p_dma_tx->stream);
                }
            }
// If DMA mode - disable DMA RX stream
            if(usart->p_dma_rx->dma_enable) {
                if(usart->p_info->xfer_status.rx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_rx->dma_name, usart->p_dma_rx->stream);
                }
            }
// Disable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, DISABLE_CMD);
// Clear pending USART interrupts in NVIC
            NVIC_ClearPendingIRQ(usart->irq_num);
// Clear driver variables
            usart->p_info->flags                        = 0U;
            usart->p_info->mode                         = 0U;
            usart->p_info->baudrate                     = 0U;
            usart->p_info->xfer_status.tx_busy          = 0U;
            usart->p_info->xfer_status.rx_busy          = 0U;
            usart->p_info->xfer_status.tx_underflow     = 0U;
            usart->p_info->xfer_status.rx_overflow      = 0U;
            usart->p_info->xfer_status.rx_break         = 0U;
            usart->p_info->xfer_status.rx_framing_error = 0U;
            usart->p_info->xfer_status.rx_parity_error  = 0U;
            usart->p_info->xfer_info.tx_def_val         = 0U;
            usart->p_info->xfer_info.rx_dump_val        = 0U;
            usart->p_info->flags &= ~ARM_USART_FLAG_POWERED;
            break;
        }
        case ARM_POWER_LOW: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
        case ARM_POWER_FULL: {
            if((usart->p_info->flags & ARM_USART_FLAG_INITIALIZED) == 0U) {
                return ARM_DRIVER_ERROR;
            }
            if((usart->p_info->flags & ARM_USART_FLAG_POWERED)     != 0U) {
                return ARM_DRIVER_OK;
            }
// Enable clock to UARTx block
            ARM_RCC_Periph_ClockCmd(usart->usart_name, ENABLE_CMD);
// Reset USART registers
            ARM_RCC_Periph_ResetCmd(usart->usart_name, ENABLE_CMD);
// Release reset signal from USART
            ARM_RCC_Periph_ResetCmd(usart->usart_name, DISABLE_CMD);
            usart->p_info->flags |= ARM_USART_FLAG_POWERED;
//If DMA mode TX - enable DMA mode
            if(usart->p_dma_tx->dma_enable) {
                usart->p_reg->CR3 |= USART_CR3_DMAT;
            }
//If DMA mode RX - enable DMA mode
            if(usart->p_dma_rx->dma_enable) {
                usart->p_reg->CR3 |= USART_CR3_DMAR;
            }
// Clear and Enable USART IRQ
            NVIC_ClearPendingIRQ(usart->irq_num);
            NVIC_EnableIRQ(usart->irq_num);
            break;
        }
        default: {
            return ARM_DRIVER_ERROR_UNSUPPORTED;
        }
    }
    return ARM_DRIVER_OK;
}

static int32_t ARM_USART_PutChar(uint8_t ch, ARM_USART_Resources_t *usart)
{
    usart->p_reg->DR = ch;
    return ARM_DRIVER_OK;
}

static uint8_t ARM_USART_GetChar(ARM_USART_Resources_t *usart)
{
    uint8_t ch = 0;
    ch = usart->p_reg->DR;
    return ch;
}

static int32_t ARM_USART_Send(const void *pdata, uint32_t num,
                              ARM_USART_Resources_t *usart)
{
    if(num == 0U) {
// Invalid parameters
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    if((usart->p_info->flags & ARM_USART_FLAG_CONFIGURED) == 0U) {
// USART is not configured (mode not selected)
        return ARM_DRIVER_ERROR;
    }
    if(usart->p_info->xfer_status.tx_busy != 0U) {
// Send is not completed yet
        return ARM_DRIVER_ERROR_BUSY;
    }
    usart->p_info->xfer_status.tx_busy = 1U;
    usart->p_info->xfer_info.p_tx_buf = (uint8_t *)pdata;
    usart->p_info->xfer_info.tx_num = num;
    usart->p_info->xfer_info.tx_cnt = 0U;

// If DMA mode TX - configure and enable stream
    if(usart->p_dma_tx->dma_enable) {
        if(ARM_DMA_StreamConfig(usart->p_dma_tx->dma_name, usart->p_dma_tx->stream,
                                usart->p_dma_tx->channel, usart->p_dma_tx->priority,
                                ARM_DMA_FIFO_REGULAR_MODE, usart->p_reg->DR,
                                (uint32_t)(usart->p_info->xfer_info.p_tx_buf), 0UL,
                                ARM_DMA_1_BYTE_PSIZE, ARM_DMA_1_BYTE_MSIZE,
                                ARM_DMA_PINC_DISABLE, ARM_DMA_MINC_ENABLE,
                                num, ARM_DMA_MEMORY_TO_PERIPHERAL_DIR,
                                ARM_DMA_FULL_FIFO_THRESHOLD,
                                ARM_DMA_FIFO_SINGLE_TRANSACTION,
                                ARM_DMA_FIFO_SINGLE_TRANSACTION,
                                usart->p_dma_tx->cb_event) == FAILED) {
            return ARM_DRIVER_ERROR;
        }
        if(ARM_DMA_StreamEnable(usart->p_dma_tx->dma_name, usart->p_dma_tx->stream) == FAILED) {
            return ARM_DRIVER_ERROR;
        }
    } else {
        // Transmit data register empty and Transmission complete interrupts enable
        usart->p_reg->CR1 |= (USART_CR1_TXEIE);
    }
    return ARM_DRIVER_OK;
}


