glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
// ARM_USART_Receive() used in asynchronous mode

// Can also be used in synchronous mode when receiving data only
//(transmits the default value ARM_USART_SET_DEFAULT_TX_VALUE as control parameter)

// If data size is unknown the IDLE interrupt is to used.
static int32_t ARM_USART_Receive(void *pdata, uint32_t num, ARM_USART_Resources_t *usart)
{
    if(num == 0U) {
// Invalid parameters
        return ARM_DRIVER_ERROR_PARAMETER;
    }
    if((usart->p_info->flags & ARM_USART_FLAG_CONFIGURED) == 0U) {
// USART is not configured (mode not selected)
        return ARM_DRIVER_ERROR;
    }

// Check reciver buzy
    if(usart->p_info->xfer_status.rx_busy != 0U) {
        return ARM_DRIVER_ERROR_BUSY;
    }

// Set RX busy flag
    usart->p_info->xfer_status.rx_busy = 1U;

    usart->p_info->xfer_status.rx_overflow = 0U;
    usart->p_info->xfer_status.rx_break = 0U;
    usart->p_info->xfer_status.rx_framing_error = 0U;
    usart->p_info->xfer_status.rx_parity_error = 0U;

    usart->p_info->xfer_info.p_rx_buf = (uint8_t *)pdata;
    usart->p_info->xfer_info.rx_num = num;
    usart->p_info->xfer_info.rx_cnt = 0U;

// If DMA mode RX - configure and enable stream
    if(usart->p_dma_rx->dma_enable) {
        if(ARM_DMA_StreamConfig(usart->p_dma_rx->dma_name, usart->p_dma_rx->stream,
                                usart->p_dma_rx->channel, usart->p_dma_rx->priority,
                                ARM_DMA_FIFO_REGULAR_MODE, usart->p_reg->DR,
                                (uint32_t)(usart->p_info->xfer_info.p_rx_buf), 0UL,
                                ARM_DMA_1_BYTE_PSIZE, ARM_DMA_1_BYTE_MSIZE,
                                ARM_DMA_PINC_DISABLE, ARM_DMA_MINC_ENABLE,
                                num, ARM_DMA_PERIPHERAL_TO_MEMORY_DIR,
                                ARM_DMA_FULL_FIFO_THRESHOLD,
                                ARM_DMA_FIFO_SINGLE_TRANSACTION,
                                ARM_DMA_FIFO_SINGLE_TRANSACTION,
                                usart->p_dma_rx->cb_event)) {
            return ARM_DRIVER_ERROR;
        }
        if(ARM_DMA_StreamEnable(usart->p_dma_rx->dma_name, usart->p_dma_rx->stream) == FAILED) {
            return ARM_DRIVER_ERROR;
        }
// Framing error, overrun error or noise flag interrupt enable
// in other case - interrupt is generated by RXNE=1 )
        usart->p_reg->CR1 |= USART_CR3_EIE;
    } else {

// Read data register not empty interrupt enable
        usart->p_reg->CR1 |= USART_CR1_RXNEIE;
    }
    return ARM_DRIVER_OK;
}

// Only in synchronous mode
static int32_t ARM_USART_Transfer(const void *data_out, void *data_in,
                                  uint32_t num, ARM_USART_Resources_t *usart)
{
    if(num == 0U) {
// Invalid parameters
        return ARM_DRIVER_ERROR_PARAMETER;
    }

    if((usart->p_info->flags & ARM_USART_FLAG_CONFIGURED) == 0U) {
// USART is not configured
        return ARM_DRIVER_ERROR;
    }

    if((usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
       (usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
// The mode is unsupported in Version 1.0
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    } else {
// Only in synchronous mode
        return ARM_DRIVER_ERROR;
    }
}

static uint32_t ARM_USART_GetTxCount(ARM_USART_Resources_t *usart)
{
    uint32_t cnt = 0UL;
    cnt = usart->p_info->xfer_info.tx_cnt;
    return cnt;
}

static uint32_t ARM_USART_GetRxCount(ARM_USART_Resources_t *usart)
{
    uint32_t cnt = 0UL;
    cnt = usart->p_info->xfer_info.rx_cnt;
    return cnt;
}

static int32_t ARM_USART_Control(uint32_t control, uint32_t arg,
                                 ARM_USART_Resources_t *usart)
{
    if((usart->p_info->flags & ARM_USART_FLAG_POWERED) == 0U) {
// USART not powered
        return ARM_DRIVER_ERROR;
    }

// Check if Receiver/Transmitter is busy
    if((usart->p_info->xfer_status.tx_busy != 0U) ||
       (usart->p_info->xfer_status.rx_busy != 0U)) {
        return ARM_DRIVER_ERROR_BUSY;
    }

    /*************************************************************************
    Miscellaneous Controls Section

    Attention!!! - Miscellaneous Controls Operations cannot be ORed!

    **************************************************************************/

    switch(control & ARM_USART_CONTROL_Msk) {
//Synchronous Receive only
        case ARM_USART_SET_DEFAULT_TX_VALUE: {
            if((usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_MASTER) ||
               (usart->p_info->mode == ARM_USART_MODE_SYNCHRONOUS_SLAVE)) {
                usart->p_info->xfer_info.tx_def_val = arg;
                return ARM_DRIVER_OK;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
//IrDA Pulse
        case ARM_USART_SET_IRDA_PULSE: {
            if(usart->p_info->mode == ARM_USART_MODE_IRDA)  {
// The mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
//Smart Card Guard Time
        case ARM_USART_SET_SMART_CARD_GUARD_TIME: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
// The mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
//Smart Card Clock
        case ARM_USART_SET_SMART_CARD_CLOCK: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
// The mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
//Smart Card NACK generation
        case ARM_USART_CONTROL_SMART_CARD_NACK: {
            if(usart->p_info->mode == ARM_USART_MODE_SMART_CARD)  {
// The mode is unsupported in Version 1.0
                return ARM_DRIVER_ERROR_UNSUPPORTED;
            } else {
                return ARM_DRIVER_ERROR;
            }
        }
// Control TX
        case ARM_USART_CONTROL_TX: {
            if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                if(arg) {
                    if(usart->p_info->mode != ARM_USART_MODE_SMART_CARD) {
                        ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                        GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                     ARM_GPIO_IO_MODE_ALT_FUNC, ARM_GPIO_IO_TYPE_PUSH_PULL ,
                                     ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                     usart-> p_pin[TX_PIN].alt_func);
                    } else {
                        ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                        GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                     ARM_GPIO_IO_MODE_ALT_FUNC, ARM_GPIO_IO_TYPE_OPEN_DRAIN ,
                                     ARM_GPIO_IO_PULL_UP, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                     usart-> p_pin[TX_PIN].alt_func);
                    }
                    usart->p_reg->CR1 |= USART_CR1_TE;
                    usart->p_info->flags |= ARM_USART_FLAG_TX_ENABLED;
                } else {
                    usart->p_reg->CR1 &= ~USART_CR1_TE;
                    usart->p_info->flags &= ~ARM_USART_FLAG_TX_ENABLED;
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[TX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[TX_PIN].GPIOx, usart-> p_pin[TX_PIN].pin,
                                 0U, 0U, 0U, 0U, 0U);
                }
            }
            return ARM_DRIVER_OK;
        }

// Control RX
        case ARM_USART_CONTROL_RX: {
            if(arg) {
                if((usart->p_info->mode != ARM_USART_MODE_SMART_CARD) &&
                   (usart->p_info->mode != ARM_USART_MODE_SINGLE_WIRE)) {
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                                 ARM_GPIO_IO_MODE_ALT_FUNC, ARM_GPIO_IO_TYPE_OPEN_DRAIN ,
                                 ARM_GPIO_IO_HI_Z, ARM_GPIO_IO_SPEED_FREQ_LOW,
                                 usart-> p_pin[RX_PIN].alt_func);
                } else {
                    ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                    GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                                 0U, 0U, 0U, 0U, 0U);
                }
                usart->p_reg->CR1 |= USART_CR1_RE;
                usart->p_info->flags |= ARM_USART_FLAG_RX_ENABLED;
            } else {
                usart->p_reg->CR1 &= ~USART_CR1_RE;
                usart->p_info->flags &= ~ARM_USART_FLAG_RX_ENABLED;
                ARM_RCC_Periph_ClockCmd(usart-> p_pin[RX_PIN].port, ENABLE_CMD);
                GPIO_SetData(usart-> p_pin[RX_PIN].GPIOx, usart-> p_pin[RX_PIN].pin,
                             0U, 0U, 0U, 0U, 0U);
            }
            return ARM_DRIVER_OK;
        }

// Control break
        case ARM_USART_CONTROL_BREAK: {
            if(arg) {
                if(usart->p_info->xfer_status.tx_busy) {
                    return ARM_DRIVER_ERROR_BUSY;
                }
                usart->p_info->xfer_status.tx_busy = 1UL;
                usart->p_reg->CR1 |= USART_CR1_SBK;
            } else {
                usart->p_reg->CR1 &= ~USART_CR1_SBK;
                usart->p_info->xfer_status.tx_busy = 0UL;
            }
            return ARM_DRIVER_OK;
        }

// Abort Send
        case ARM_USART_ABORT_SEND: {
// Disable TXE and TC interrupts
            usart->p_reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);
// If DMA mode - disable DMA TX stream
            if(usart->p_dma_tx->dma_enable) {
                if(usart->p_info->xfer_status.tx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_tx->dma_name, usart->p_dma_tx->stream);
                }
            }
            usart->p_info->xfer_info.tx_cnt = 0UL;
            usart->p_info->xfer_status.tx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        case ARM_USART_ABORT_RECEIVE: {
// Disable RXNE interrupt
            usart->p_reg->CR1 &= ~USART_CR1_RXNEIE;
// Disable PE interrupt
            usart->p_reg->SR &= ~USART_SR_PE;
// Disable FE, ORE and NF interrupts
            usart->p_reg->CR3 &= ~USART_CR3_EIE;
// If DMA mode - disable DMA RX stream
            if(usart->p_dma_rx->dma_enable) {
                if(usart->p_info->xfer_status.rx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_rx->dma_name, usart->p_dma_rx->stream);
                }
            }
            usart->p_info->xfer_info.rx_cnt = 0UL;
            usart->p_info->xfer_status.rx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        case ARM_USART_ABORT_TRANSFER: {
// Disable TXE and TC interrupts
            usart->p_reg->CR1 &= ~(USART_CR1_TXEIE | USART_CR1_TCIE);
// Disable RXNE interrupt
            usart->p_reg->CR1 &= ~USART_CR1_RXNEIE;
// Disable PE interrupt
            usart->p_reg->SR &= ~USART_SR_PE;
// Disable FE, ORE and NF interrupts
            usart->p_reg->CR3 &= ~USART_CR3_EIE;
// If DMA mode - disable DMA TX stream
            if(usart->p_dma_tx->dma_enable) {
                if(usart->p_info->xfer_status.tx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_tx->dma_name, usart->p_dma_tx->stream);
                }
            }
// If DMA mode - disable DMA RX stream
            if(usart->p_dma_rx->dma_enable) {
                if(usart->p_info->xfer_status.rx_busy) {
                    ARM_DMA_StreamDisable(usart->p_dma_rx->dma_name, usart->p_dma_rx->stream);
                }
            }
            usart->p_info->xfer_info.tx_cnt = 0UL;
            usart->p_info->xfer_info.rx_cnt = 0UL;
            usart->p_info->xfer_status.tx_busy = 0UL;
            usart->p_info->xfer_status.rx_busy = 0UL;
            return ARM_DRIVER_OK;
        }
        default: {
            break;
        }
    }

    /*************************************************************************

