glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
static int32_t ARM_USART_SetBaudrate(uint32_t arg, ARM_USART_Resources_t *usart)
{

// Baudrate = clock_freq/(8*(2-oversampl8)*div)
    uint32_t div = 0UL;
    uint32_t div_mantissa = 0UL;
    uint32_t div_fraction = 0UL;
    uint32_t oversampl8 = 0UL;
    uint32_t baudrate = arg;

    uint32_t clock_freq = ARM_RCC_GetPeriphClock(usart->usart_name);
    if(clock_freq == 0) {
        return ARM_USART_ERROR_BAUDRATE;
    }
    if(arg == 0) {
        return ARM_USART_ERROR_BAUDRATE;
    }

    uint32_t mode = usart->p_info->mode;
    switch(mode) {
        case ARM_USART_MODE_ASYNCHRONOUS:
        case ARM_USART_MODE_SYNCHRONOUS_MASTER:
        case ARM_USART_MODE_SYNCHRONOUS_SLAVE: {
            oversampl8 = (usart->p_reg->CR1 & USART_CR1_OVER8_Msk) ? 1UL : 0UL;
            break;
        }
        case ARM_USART_MODE_SINGLE_WIRE:
        case ARM_USART_MODE_IRDA:
        case ARM_USART_MODE_SMART_CARD: {
            oversampl8 = 0;
            break;
        }
        default: {
            return ARM_USART_ERROR_BAUDRATE;
        }
    }
    if(oversampl8) {

// For oversampling by 8

// For rounding in the least significant bit, multiply by 2,
// add 1 and shift to the right by 1
        div = (clock_freq * 8 * 2 / (baudrate * 8 * (2 - oversampl8)));
        div |= 1;
        div >>= 1;
        div_mantissa = (uint32_t)((div & ARM_USART_DIVIDER_MANTISSA_FOR_OVER8_MASK) << 1);
        div_fraction = (uint32_t)(div & ARM_USART_DIVIDER_FRACTION_FOR_OVER8_MASK);
    } else {

// For oversampling by 16

// For rounding in the least significant bit, multiply by 2,
// add 1 and shift to the right by 1
        div = (clock_freq * 16 * 2 / (baudrate * 8 * (2 - oversampl8)));
        div |= 1;
        div >>= 1;
        div_mantissa = (uint32_t)(div & ARM_USART_DIVIDER_MANTISSA_FOR_OVER16_MASK);
        div_fraction = (uint32_t)(div & ARM_USART_DIVIDER_FRACTION_FOR_OVER16_MASK);
    }
    usart->p_reg->BRR = (div_mantissa | div_fraction);
    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS ARM_USART_GetStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_STATUS status;
    status.tx_busy = usart->p_info->xfer_status.tx_busy; //Transmitter busy flag
    status.rx_busy = usart->p_info->xfer_status.rx_busy; //Receiver busy flag
    status.tx_underflow = usart->p_info->xfer_status.tx_underflow; //Transmit data underflow detected (cleared on start of next send operation)
    status.rx_overflow = usart->p_info->xfer_status.rx_overflow; //Receive data overflow detected (cleared on start of next receive operation)
    status.rx_break = usart->p_info->xfer_status.rx_break; //Break detected on receive (cleared on start of next receive operation)
    status.rx_framing_error = usart->p_info->xfer_status.rx_framing_error; //Framing error detected on receive (cleared on start of next receive operation)
    status.rx_parity_error = usart->p_info->xfer_status.rx_parity_error; //Parity error detected on receive (cleared on start of next receive operation)
    status.reserved = usart->p_info->xfer_status.reserved;
    return status;
}

static int32_t ARM_USART_SetModemControl(ARM_USART_MODEM_CONTROL control, ARM_USART_Resources_t *usart)
{
// to do
    return ARM_DRIVER_OK;
}

static ARM_USART_MODEM_STATUS ARM_USART_GetModemStatus(ARM_USART_Resources_t *usart)
{
    ARM_USART_MODEM_STATUS status;
    status.cts = usart->p_info->modem_status.cts; //CTS state: 1=Active, 0=Inactive
    status.dsr = usart->p_info->modem_status.dsr; //DSR state: 1=Active, 0=Inactive
    status.dcd = usart->p_info->modem_status.dcd; //DCD state: 1=Active, 0=Inactive
    status.ri = usart->p_info->modem_status.ri; //RI  state: 1=Active, 0=Inactive
    status.reserved = usart->p_info->modem_status.reserved;
    return status;
}

static void USART_IRQHandler(ARM_USART_Resources_t *usart)
{
    uint32_t flag = usart->p_reg->SR;
    uint32_t event = 0U;
    uint8_t ch = 0U;
    ARM_USART_TransferInfo_t *p_str = &(usart->p_info->xfer_info);

// Transmit Data Register Empty
    if((flag & USART_SR_TXE) && (usart->p_info->xfer_status.tx_busy == 1)) {
        if(RingBuffer_ReadChar(&USART1_TxRBuff, &ch)) {
            event |= ARM_USART_EVENT_RING_BUFFER_UNDERFLOW;
        } else {
            if(ARM_USART_PutChar(ch, usart) == ARM_DRIVER_OK) {
                p_str->tx_cnt++;
                if(ARM_USART_GetTxCount(usart) == p_str->tx_num) {
                    // Wait for transmission complete
                    while((usart->p_reg->SR & USART_SR_TC) == 0U);
                    usart->p_reg->CR1 &= ~USART_CR1_TXEIE;
                    usart->p_info->xfer_status.tx_busy = 0U;
                    p_str->tx_num = 0U;
                    p_str->tx_cnt = 0U;
                    event |= ARM_USART_EVENT_TX_COMPLETE;
                }
            }
        }
    }

// OverRun Error - (interrupt is generated by this bit only for  Multi
// Buffer Communication - DMA mode RX, in other case interrupt is already
// generated by RXNE=1 )
    if(flag & USART_SR_ORE) {
        usart->p_info->xfer_status.rx_overflow = 1U;
        event |= ARM_USART_EVENT_RX_OVERFLOW;
    }

// Noise Error or
// Framing Error (de-synchronization, excessive noise, a break character is detected)
// (interrupt is generated by this bit only for  Multi Buffer Communication - DMA mode RX)
// in other case - interrupt is already generated by RXNE=1 )
    if(flag & (USART_SR_NE | USART_SR_FE)) {
        usart->p_info->xfer_status.rx_framing_error = 1U;
        event |= ARM_USART_EVENT_RX_FRAMING_ERROR;
    }

// Parity Error
    if(flag & USART_SR_PE) {
        if(flag & USART_SR_RXNE) {
            usart->p_info->xfer_status.rx_parity_error = 1U;
            event |= ARM_USART_EVENT_RX_PARITY_ERROR;
        }
    }

// IDLE line detected
    if(flag & USART_SR_IDLE) {
        event |= ARM_USART_EVENT_RX_IDLE;
    }

// Read Data Register Not Empty
    if(flag & USART_SR_RXNE) {
        ch = ARM_USART_GetChar(usart);
        if(RingBuffer_WriteChar(&USART1_RxRBuff, &ch)) {
            event |= ARM_USART_EVENT_RING_BUFFER_OVERFLOW;
        } else {
            p_str->rx_cnt++;
            usart->p_reg ->SR &= ~USART_SR_RXNE;
            if(ARM_USART_GetRxCount(usart) == p_str->rx_num) {
                usart->p_reg->CR1 &= ~USART_CR1_RXNEIE;
                usart->p_info->xfer_status.rx_busy = 0U;
                p_str->rx_num = 0U;
                p_str->rx_cnt = 0U;
                event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
            }
        }
    }

    if(event != 0U) {
        usart->p_info->cb(event);
    }

