glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
}

static void USART_cb(uint32_t event, ARM_USART_Resources_t *usart)
{
    if(event & ARM_USART_EVENT_TX_COMPLETE) {

    }

    if(event & ARM_USART_EVENT_RECEIVE_COMPLETE) {

    }

    if(event & ARM_USART_EVENT_RING_BUFFER_OVERFLOW) {
#ifdef _ARM_USART_DEBUG_
        LOG("Warning! Ring buffer overflow");
#endif //_ARM_USART_DEBUG_
    }

    if(event & ARM_USART_EVENT_RING_BUFFER_UNDERFLOW) {
#ifdef _ARM_USART_DEBUG_
        LOG("Warning! Ring buffer underflow");
#endif //_ARM_USART_DEBUG_
    }

    if(event & ARM_USART_EVENT_RX_OVERFLOW) {
        // to do
#ifdef _ARM_USART_DEBUG_
        LOG("Warning! At least 1 data has been lost in shift register.");
#endif //_ARM_USART_DEBUG_
        usart->p_info->xfer_status.rx_overflow = 0U;
    }

    if(event & ARM_USART_EVENT_RX_FRAMING_ERROR) {
        // to do
#ifdef _ARM_USART_DEBUG_
        LOG("Warning! The invalid data or a break character is transferred from the Shift register to the USART_DR register.");
#endif //_ARM_USART_DEBUG_
        usart->p_info->xfer_status.rx_framing_error = 0U;
    }

    if(event & ARM_USART_EVENT_RX_PARITY_ERROR) {
        // to do
#ifdef _ARM_USART_DEBUG_
        LOG("Warning! The parity check failed.");
#endif //_ARM_USART_DEBUG_
        usart->p_info->xfer_status.rx_parity_error = 0U;
    }
}

#if(USART_USE_RX_DMA)
static void ARM_USART_DMA_RxEvent(uint32_t event, ARM_USART_Resources_t *usart)
{

    uint32_t usart_event = 0;
    ARM_USART_TransferInfo_t *p_str = &(usart->p_info->xfer_info);
    if(event & ARM_DMA_EVENT_TRANSFER_COMPLETE) {
        p_str->rx_cnt = p_str->rx_num;
        usart->p_info->xfer_status.rx_busy = 0U;
        p_str->rx_num = 0U;
        p_str->rx_cnt = 0U;
        usart_event |= ARM_USART_EVENT_RECEIVE_COMPLETE;
    }
    if(event & ARM_DMA_EVENT_TRANSFER_ERROR) {

    }
    if(event & ARM_DMA_EVENT_DIRECT_MODE_ERROR) {

    }
    if(event & ARM_DMA_EVENT_FIFO_ERROR) {

    }
    if(usart_event != 0U) {
        usart->p_info->cb(usart_event);
    }

}
#endif //(USART_USE_RX_DMA)

#if(USART_USE_TX_DMA)

static void ARM_USART_DMA_TxEvent(uint32_t event, ARM_USART_Resources_t *usart)
{
    uint32_t usart_event = 0;
    ARM_USART_TransferInfo_t *p_str = &(usart->p_info->xfer_info);
    if((event & ARM_DMA_EVENT_TRANSFER_COMPLETE) && (usart->p_info->xfer_status.tx_busy == 1)) {
        p_str->tx_cnt = p_str->tx_num;
        usart->p_info->xfer_status.tx_busy = 0U;
        p_str->tx_num = 0U;
        p_str->tx_cnt = 0U;
        usart_event |= ARM_USART_EVENT_TX_COMPLETE;
    }
    if(event & ARM_DMA_EVENT_TRANSFER_ERROR) {

    }
    if(event & ARM_DMA_EVENT_DIRECT_MODE_ERROR) {

    }
    if(event & ARM_DMA_EVENT_FIFO_ERROR) {

    }
    if(usart_event != 0U) {
        usart->p_info->cb(usart_event);
    }

}
#endif //(USART_USE_TX_DMA)

/*************************************************
Driver capabilities of USART2, USART3, USART6 are completely
similar to USART1 driver capabilities.
***************************************************/
#if (RTE_USART1)

static void ARM_USART1_Resources_Struct_Init(void)
{
    ARM_USART_Resources_t *p_str = &ARM_USART1_Resources;
    p_str->capabilities.asynchronous = 1;               // supports UART (Asynchronous) mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.synchronous_master = 1;         // supports Synchronous Master mode
#else
    p_str->capabilities.synchronous_master = 0;         // supports Synchronous Master mode
#endif //(RTE_USART1_CK_ID > 0)

    p_str->capabilities.synchronous_slave = 0;          // supports Synchronous Slave mode
    p_str->capabilities.single_wire = 1;                // supports UART Single-wire mode
    p_str->capabilities.irda = 1;                       // supports UART IrDA mode

#if (RTE_USART1_CK_ID > 0)
    p_str->capabilities.smart_card =  1;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  1;          // Smart Card Clock generator available
#else
    p_str->capabilities.smart_card =  0;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  0;          // Smart Card Clock generator available
#endif //(RTE_USART1_CK_ID > 0)

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.flow_control_rts =  1;          // RTS Flow Control available
#else
    p_str->capabilities.flow_control_rts =  0;          // RTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0) 

#if RTE_USART1_CTS_ID > 0
    p_str->capabilities.flow_control_cts =  1;          // CTS Flow Control available
#else
    p_str->capabilities.flow_control_cts =  0;          // CTS Flow Control available
#endif //(RTE_USART1_CTS_ID > 0)               

    p_str->capabilities.event_tx_complete =  1;         // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    p_str->capabilities.event_rx_timeout =  0;          // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.rts =  1;                       // RTS Line: 0=not available, 1=available
#else
    p_str->capabilities.rts =  0;                       // RTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0) 

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.cts =  1;                       // CTS Line: 0=not available, 1=available
#else
    p_str->capabilities.cts =  0;                       // CTS Line: 0=not available, 1=available
#endif //(RTE_USART1_CTS_ID > 0)       

    p_str->capabilities.dtr =  0;                       // DTR Line: 0=not available, 1=available
    p_str->capabilities.dsr =  0;                       // DSR Line: 0=not available, 1=available
    p_str->capabilities.dcd =  0;                       // DCD Line: 0=not available, 1=available
    p_str->capabilities.ri =  0;                        // RI Line: 0=not available, 1=available

#if (RTE_USART1_CTS_ID > 0)
    p_str->capabilities.event_cts = 1;                  // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#else
    p_str->capabilities.event_cts =  0;                 // Signal CTS change event: \ref ARM_USART_EVENT_CTS
#endif //(RTE_USART1_CTS_ID > 0) 

    p_str->capabilities.event_dsr =  0;                 // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    p_str->capabilities.event_dcd =  0;                 // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    p_str->capabilities.event_ri =  0;                  // Signal RI change event: \ref ARM_USART_EVENT_RI
    p_str->capabilities.reserved =  0;                  // Reserved (must be zero)
    p_str->usart_name = USART_1;                        //Interface name
    p_str->p_reg = USART1;                              // Pointer to USART peripheral registers
    p_str->p_pin = USART_GetPinCfg(USART_1);         // Pointer to USART pins configuration
    p_str->irq_num = USART1_IRQn;

