glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
#if(RTE_USART1_TX_DMA)
    p_str->p_dma_tx = &ARM_USART1_DMA_Tx;
    if(RTE_USART1_TX_DMA_NUMBER == 1) {
        p_str->p_dma_tx->dma_name = DMA_1;
    }
    if(RTE_USART1_TX_DMA_NUMBER == 2) {
        p_str->p_dma_tx->dma_name = DMA_2;
    }
    p_str->p_dma_tx->stream = (eARM_DMA_StreamNumbers)RTE_USART1_TX_DMA_STREAM;
    p_str->p_dma_tx->channel = (eARM_DMA_ChanNumbers)RTE_USART1_TX_DMA_CHANNEL;
    p_str->p_dma_tx->priority = (uint8_t)RTE_USART1_TX_DMA_PRIORITY;
    p_str->p_dma_tx->cb_event = &ARM_USART1_DMA_TxEvent;
#endif //(RTE_USART1_TX_DMA)

#if(RTE_USART1_RX_DMA)
    p_str->p_dma_rx = &ARM_USART1_DMA_Rx;
    if(RTE_USART1_RX_DMA_NUMBER == 1) {
        p_str->p_dma_rx->dma_name = DMA_1;
    }
    if(RTE_USART1_RX_DMA_NUMBER == 2) {
        p_str->p_dma_rx->dma_name = DMA_2;
    }
    p_str->p_dma_rx->stream = (eARM_DMA_StreamNumbers)RTE_USART1_RX_DMA_STREAM;
    p_str->p_dma_rx->channel = (eARM_DMA_ChanNumbers)RTE_USART1_RX_DMA_CHANNEL;
    p_str->p_dma_rx->priority = (uint8_t)RTE_USART1_RX_DMA_PRIORITY;
    p_str->p_dma_rx->cb_event = &ARM_USART1_DMA_RxEvent;
#endif //(RTE_USART1_RX_DMA)

    p_str->p_info = &USART1_Info;
}

static ARM_USART_CAPABILITIES ARM_USART1_GetCapabilities(void)
{
    return ARM_USART_GetCapabilities(&ARM_USART1_Resources);
}

static int32_t ARM_USART1_Initialize(ARM_USART_SignalEvent_t cb_event)
{
    return ARM_USART_Initialize(cb_event, &ARM_USART1_Resources);
}
static int32_t ARM_USART1_Uninitialize(void)
{
    return ARM_USART_Uninitialize(&ARM_USART1_Resources);
}
static int32_t ARM_USART1_PowerControl(ARM_POWER_STATE state)
{
    return ARM_USART_PowerControl(state, &ARM_USART1_Resources);

}
static int32_t ARM_USART1_Send(const void *data, uint32_t num)
{
    return ARM_USART_Send(data, num, &ARM_USART1_Resources);
}

static int32_t ARM_USART1_Receive(void *data, uint32_t num)
{
    return ARM_USART_Receive(data, num, &ARM_USART1_Resources);
}
static int32_t ARM_USART1_Transfer(const void *data_out,
                                   void      *data_in,
                                   uint32_t   num)
{
    return ARM_USART_Transfer(data_out, data_in, num, &ARM_USART1_Resources);
}
static uint32_t ARM_USART1_GetTxCount(void)
{
    return ARM_USART_GetTxCount(&ARM_USART1_Resources);
}
static uint32_t ARM_USART1_GetRxCount(void)
{
    return ARM_USART_GetRxCount(&ARM_USART1_Resources);
}

static int32_t ARM_USART1_Control(uint32_t control, uint32_t arg)
{
    return ARM_USART_Control(control, arg, &ARM_USART1_Resources);
}

static ARM_USART_STATUS ARM_USART1_GetStatus(void)
{
    return ARM_USART_GetStatus(&ARM_USART1_Resources);
}

static int32_t ARM_USART1_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return ARM_USART_SetModemControl(control, &ARM_USART1_Resources);
}

static ARM_USART_MODEM_STATUS ARM_USART1_GetModemStatus(void)
{
    return ARM_USART_GetModemStatus(&ARM_USART1_Resources);
}

void USART1_IRQHandler(void)
{
    USART_IRQHandler(&ARM_USART1_Resources);
}

static void USART1_cb(uint32_t event)
{
    USART_cb(event, &ARM_USART1_Resources);
}

#if(RTE_USART1_RX_DMA)
static void ARM_USART1_DMA_RxEvent(uint32_t event)
{
    ARM_USART_DMA_RxEvent(event, &ARM_USART1_Resources);
}
#endif //(RTE_USART1_RX_DMA)

#if(RTE_USART1_TX_DMA)

static void ARM_USART1_DMA_TxEvent(uint32_t event)
{
    ARM_USART_DMA_TxEvent(event, &ARM_USART1_Resources);
}
#endif //(RTE_USART1_TX_DMA)

//********************************************************************************
//Variables (continuation after function prototypes have been defined)
//********************************************************************************

ARM_DRIVER_USART ARM_USART1_Driver = {
    ARM_USARTx_GetVersion,
    ARM_USART1_GetCapabilities,
    ARM_USART1_Initialize,
    ARM_USART1_Uninitialize,
    ARM_USART1_PowerControl,
    ARM_USART1_Send,
    ARM_USART1_Receive,
    ARM_USART1_Transfer,
    ARM_USART1_GetTxCount,
    ARM_USART1_GetRxCount,
    ARM_USART1_Control,
    ARM_USART1_GetStatus,
    ARM_USART1_SetModemControl,
    ARM_USART1_GetModemStatus
};

#endif //(RTE_USART1)

/*************************************************
Driver capabilities of UART5 are completely
similar to UART4 driver capabilities.
***************************************************/
#if (RTE_UART4)

static void ARM_UART4_Resources_Struct_Init(void)
{
    ARM_USART_Resources_t *p_str = &ARM_UART4_Resources;
    p_str->capabilities.asynchronous = 1;               // supports UART (Asynchronous) mode
    p_str->capabilities.synchronous_master = 0;         // supports Synchronous Master mode
    p_str->capabilities.synchronous_slave = 0;          // supports Synchronous Slave mode
    p_str->capabilities.single_wire = 1;                // supports UART Single-wire mode
    p_str->capabilities.irda = 1;                       // supports UART IrDA mode
    p_str->capabilities.smart_card =  0;                // supports UART Smart Card mode
    p_str->capabilities.smart_card_clock =  0;          // Smart Card Clock generator available
    p_str->capabilities.flow_control_rts =  0;          // RTS Flow Control available
    p_str->capabilities.flow_control_cts =  0;          // CTS Flow Control available
    p_str->capabilities.event_tx_complete =  1;         // Transmit completed event: \ref ARM_USART_EVENT_TX_COMPLETE
    p_str->capabilities.event_rx_timeout =  0;          // Signal receive character timeout event: \ref ARM_USART_EVENT_RX_TIMEOUT
    p_str->capabilities.rts =  0;                       // RTS Line: 0=not available, 1=available
    p_str->capabilities.cts =  0;                       // CTS Line: 0=not available, 1=available
    p_str->capabilities.dtr =  0;                       // DTR Line: 0=not available, 1=available
    p_str->capabilities.dsr =  0;                       // DSR Line: 0=not available, 1=available
    p_str->capabilities.dcd =  0;                       // DCD Line: 0=not available, 1=available
    p_str->capabilities.ri =  0;                        // RI Line: 0=not available, 1=available
    p_str->capabilities.event_cts =  0;                 // Signal CTS change event: \ref ARM_USART_EVENT_CTS
    p_str->capabilities.event_dsr =  0;                 // Signal DSR change event: \ref ARM_USART_EVENT_DSR
    p_str->capabilities.event_dcd =  0;                 // Signal DCD change event: \ref ARM_USART_EVENT_DCD
    p_str->capabilities.event_ri =  0;                  // Signal RI change event: \ref ARM_USART_EVENT_RI
    p_str->capabilities.reserved =  0;                  // Reserved (must be zero)
    p_str->usart_name = UART_4;                        //Interface name
    p_str->p_reg = UART4;                              // Pointer to USART peripheral registers
    p_str->p_pin = USART_GetPinCfg(UART_4);         // Pointer to USART pins configuration
    p_str->irq_num = UART4_IRQn;

#if(RTE_UART4_TX_DMA)
    p_str->p_dma_tx = &ARM_UART4_DMA_Tx;
    if(RTE_UART4_TX_DMA_NUMBER == 1) {
        p_str->p_dma_tx->dma_name = DMA_1;
    }
    if(RTE_UART4_TX_DMA_NUMBER == 2) {
        p_str->p_dma_tx->dma_name = DMA_2;
    }
    p_str->p_dma_tx->stream = (eARM_DMA_StreamNumbers)RTE_UART4_TX_DMA_STREAM;
    p_str->p_dma_tx->channel = (eARM_DMA_ChanNumbers)RTE_UART4_TX_DMA_CHANNEL;
    p_str->p_dma_tx->priority = (uint8_t)RTE_UART4_TX_DMA_PRIORITY;
    p_str->p_dma_tx->cb_event = &ARM_UART4_DMA_TxEvent;
#endif //(RTE_UART4_TX_DMA)

#if(RTE_UART4_RX_DMA)
    p_str->p_dma_rx = &ARM_UART4_DMA_Rx;
    if(RTE_UART4_RX_DMA_NUMBER == 1) {
        p_str->p_dma_rx->dma_name = DMA_1;
    }
    if(RTE_UART4_RX_DMA_NUMBER == 2) {
        p_str->p_dma_rx->dma_name = DMA_2;
    }
    p_str->p_dma_rx->stream = (eARM_DMA_StreamNumbers)RTE_UART4_RX_DMA_STREAM;
    p_str->p_dma_rx->channel = (eARM_DMA_ChanNumbers)RTE_UART4_RX_DMA_CHANNEL;
    p_str->p_dma_rx->priority = (uint8_t)RTE_UART4_RX_DMA_PRIORITY;
    p_str->p_dma_rx->cb_event = &ARM_UART4_DMA_RxEvent;
#endif //(RTE_UART4_RX_DMA)

