glor-hub/glor-hub-stm32f407_uart_cmsis/App/3_Driver/arm_usart.c
    p_str->p_info = &UART4_Info;
}
#endif //(RTE_UART4)

//================================================================================
//Public
//================================================================================

bool ARM_USART_isReady(int32_t status)
{
    return(status == ARM_DRIVER_OK);
}

int32_t ARM_USART_Init(void)
{

#if (RTE_USART1)

    ARM_DRIVER_USART *p_drv = &ARM_USART1_Driver;
    ARM_USART_Resources_t *usart = &ARM_USART1_Resources;
    ARM_USART1_Resources_Struct_Init();
    int32_t status = ARM_DRIVER_OK;
    status |= p_drv->Initialize(&USART1_cb);
    status |= p_drv->PowerControl(ARM_POWER_FULL);
    status |= p_drv->Control(ARM_USART_MODE_ASYNCHRONOUS |
                             ARM_USART_DATA_BITS_8 |
                             ARM_USART_PARITY_NONE |
                             ARM_USART_STOP_BITS_1 |
                             ARM_USART_FLOW_CONTROL_NONE,
                             57600);
    status |= p_drv->Control(ARM_USART_CONTROL_TX, TRUE);
    status |= p_drv->Control(ARM_USART_CONTROL_RX, TRUE);
    if(usart->p_dma_tx->dma_enable == FALSE) {
        RingBuffer_Init(&USART1_TxRBuff, USART1_TxRingBuffer);
    }
    if(usart->p_dma_rx->dma_enable == FALSE) {
        RingBuffer_Init(&USART1_RxRBuff, USART1_RxRingBuffer);
    }
//    usart->p_reg->CR1 |= USART_CR1_RXNEIE;
    return status;

#endif //(RTE_USART1)
}

void ARM_USART_Test(void)
{

#if (RTE_USART1)

    ARM_DRIVER_USART *p_drv = &ARM_USART1_Driver;
    ARM_USART_Resources_t *usart = &ARM_USART1_Resources;
    volatile uint8_t num_char = 16;
    uint8_t ch = 0;
    if(usart->p_dma_rx->dma_enable) {
        p_drv->Receive(USART1_DMA_RxBuff, num_char);
    } else {
        p_drv->Receive(USART1_RxRBuff.p_buff, num_char);
    }
    while(p_drv->GetStatus().rx_busy);
    if(usart->p_dma_rx->dma_enable) {
        memcpy((uint8_t *)USART1_DMA_TxBuff, (uint8_t *)USART1_DMA_RxBuff,
               num_char);
        p_drv->Send(USART1_DMA_TxBuff, num_char);
    } else {
        num_char = RingBuffer_GetCount(&USART1_RxRBuff);
        while(RingBuffer_GetCount(&USART1_RxRBuff)) {
            RingBuffer_ReadChar(&USART1_RxRBuff, &ch);
            RingBuffer_WriteChar(&USART1_TxRBuff, &ch);
            p_drv->Send(USART1_TxRBuff.p_buff, num_char);

        }
    }
    while(1);

#endif //(RTE_USART1)
}
